#+AUTHOR: Richie Kirchofer

* 🛑 This is not related to the package. You can stop reading. :noexport:

#+BEGIN_SRC emacs-lisp
(setq lexical-binding t)

(defun my/create-diff-svg (filename width red-text green-text)
  "Create a diff-style SVG file with red and green text.
  FILENAME is the path, WIDTH the canvas width, RED-TEXT and
  GREEN-TEXT are the strings to display."
  (let* ((svg (svg-create width 20))
         (text-node
          (dom-node 'text
                    `((font-family . "monospace") (font-size . "16px")
                      (font-weight . "bold") (x . "50%") (y . "50%")
                      (dominant-baseline . "middle") (text-anchor . "middle")))))
    (dom-append-child text-node
                      (dom-node 'tspan `((fill . ,(face-foreground 'magit-diff-removed))) red-text))
    (dom-append-child text-node
                      (dom-node 'tspan `((fill . ,(face-foreground 'magit-diff-added))) green-text))
    (svg--append svg text-node)
    (with-temp-file filename
      (svg-print svg))))
(make-directory "assets" t)

(my/create-diff-svg "assets/diff-1.svg" 25 "-" "+")
(my/create-diff-svg "assets/diff-2.svg" 115 "---" "++++++++")
(my/create-diff-svg "assets/diff-3.svg" 85 "-115" "+250")
(my/create-diff-svg "assets/diff-4.svg" 45 "--" "++")
(my/create-diff-svg "assets/diff-5.svg" 85 "-170" "+630")
(my/create-diff-svg "assets/diff-6.svg" 105 "-2.1K" "+3.9M")

"Successfully generated 3 SVG files in ./assets/"
#+END_SRC

#+RESULTS:
: Successfully generated 3 SVG files in ./assets/
